
Процедура ДействияФормыФайлОткрыть(Кнопка)
	ПрочитатьНастройкиОтчетаИзФайла();
КонецПроцедуры

Процедура ДействияФормыСохранить(Кнопка)
	ВыполнитьСохранениеНастроекОтчетаВФайл(Ложь);
КонецПроцедуры

Процедура ДействияФормыСохранитьКак(Кнопка)
	ВыполнитьСохранениеНастроекОтчетаВФайл(Ложь);
КонецПроцедуры

Процедура ОбновлениеОтображения()
	Заголовок=ИмяФайла;
КонецПроцедуры

Процедура ДействияФормыНастройкаСтруктуры(Кнопка)
	Форма=ПолучитьФорму("ФормаНастройкиСтруктурыОтчета");
	Форма.ОткрытьМодально();
КонецПроцедуры


Процедура ВыполнитьСохранениеНастроекОтчетаВФайл(ВТекущийФайл=Истина) 
	Если НЕ ВТекущийФайл Тогда
		ДВФ=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДВФ.Фильтр="Файлы XML|*.xml";
		ДВФ.Расширение="xml";
		ДВФ.ПолноеИмяФайла=ИмяФайла;
		Если Не ДВФ.Выбрать() Тогда
			Возврат;
		КонецЕсли;
		
		ИмяФайла=ДВФ.ПолноеИмяФайла;
	КонецЕсли;
	
	ЗаписьТекста=Новый ЗаписьXML;
	ЗаписьТекста.ОткрытьФайл(ИмяФайла,"utf-8");
	ЗаписьТекста.ЗаписатьОбъявлениеXML();
	ЗаписьТекста.ЗаписатьНачалоЭлемента("Настройки");
	
	ЗаписьТекста.ЗаписатьНачалоЭлемента("СтатьиОтчета");
	
	//ЗаписьТекста.ЗаписатьТекст()
	Для Каждого ТекСтатья ИЗ СтатьиОтчета Цикл
		ЗаписьТекста.ЗаписатьНачалоЭлемента("Статья");
		ЗаписьТекста.ЗаписатьАтрибут("НомерСтроки",XMLСтрока(ТекСтатья.НомерСтроки));
		ЗаписьТекста.ЗаписатьАтрибут("Идентификатор",XMLСтрока(ТекСтатья.Идентификатор));
		ЗаписьТекста.ЗаписатьАтрибут("Наименование",XMLСтрока(ТекСтатья.Наименование));
		ЗаписьТекста.ЗаписатьАтрибут("Знак",XMLСтрока(ТекСтатья.Знак));
		ЗаписьТекста.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	ЗаписьТекста.ЗаписатьКонецЭлемента();
	
	ЗаписьТекста.ЗаписатьНачалоЭлемента("ИсточникиДанных");
	
	ЗаписьТекста.ЗаписатьТекст(XMLСтрока(Новый ХранилищеЗначения(ИсточникиДанных)));
	//Для Каждого ТекСтатья ИЗ СтатьиОтчета Цикл
	//	ЗаписьТекста.ЗаписатьНачалоЭлемента("Статья");
	//	ЗаписьТекста.ЗаписатьАтрибут("НомерСтроки",XMLСтрока(ТекСтатья.НомерСтроки));
	//	ЗаписьТекста.ЗаписатьАтрибут("Идентификатор",XMLСтрока(ТекСтатья.Идентификатор));
	//	ЗаписьТекста.ЗаписатьАтрибут("Наименование",XMLСтрока(ТекСтатья.Наименование));
	//	ЗаписьТекста.ЗаписатьАтрибут("Знак",XMLСтрока(ТекСтатья.Знак));
	//	ЗаписьТекста.ЗаписатьКонецЭлемента();
	//КонецЦикла;	
	ЗаписьТекста.ЗаписатьКонецЭлемента();
	
	ЗаписьТекста.ЗаписатьНачалоЭлемента("НастройкиКомпоновки");
	
	ЗаписьТекста.ЗаписатьТекст(XMLСтрока(Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки())));
	ЗаписьТекста.ЗаписатьКонецЭлемента();
	
	ЗаписьТекста.ЗаписатьКонецЭлемента();
	ЗаписьТекста.Закрыть();
КонецПроцедуры	

Процедура ПрочитатьНастройкиОтчетаИзФайла()
	ДВФ=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.Фильтр="Файлы XML|*.xml";
	ДВФ.Расширение="xml";
	ДВФ.ПолноеИмяФайла=ИмяФайла;
	Если Не ДВФ.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникиДанных.Очистить();
	СтатьиОтчета.Очистить();
	
	ИмяФайла=ДВФ.ПолноеИмяФайла;
	
	Чтение=Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяФайла);
	
	ИмяЭлемента="";
	Пока чтение.Прочитать() Цикл
		Если Чтение.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			ИмяЭлемента=Чтение.Имя;
			
			Если ИмяЭлемента="Статья" Тогда
				НоваяСтатья=СтатьиОтчета.Добавить();
				НоваяСтатья.Идентификатор=XMLЗначение(Тип("Строка"),Чтение.ПолучитьАтрибут("Идентификатор"));
				НоваяСтатья.Наименование=XMLЗначение(Тип("Строка"),Чтение.ПолучитьАтрибут("Наименование"));
				НоваяСтатья.Знак=XMLЗначение(Тип("Число"),Чтение.ПолучитьАтрибут("Знак"));
			КонецЕсли;
		ИначеЕсли Чтение.ТипУзла=ТипУзлаXML.Текст Тогда
			Если ИмяЭлемента="ИсточникиДанных" Тогда
				ТекИсточникиХранилище=XMLЗначение(Тип("ХранилищеЗначения"),Чтение.Значение);
				Если ТекИсточникиХранилище<>Неопределено Тогда
					ТекИсточники=ТекИсточникиХранилище.Получить();
					Если ТипЗнч(ТекИсточники)=Тип("ТаблицаЗначений") Тогда
						ИсточникиДанных=ТекИсточники.Скопировать();
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ИмяЭлемента="НастройкиКомпоновки" Тогда
				ТекХранилище=XMLЗначение(Тип("ХранилищеЗначения"),Чтение.Значение);
				Если ТекХранилище<>Неопределено Тогда
					ТекНастройки=ТекХранилище.Получить();
					КомпоновщикНастроек.ЗагрузитьНастройки(ТекНастройки);
					КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Чтение.Закрыть();
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(ДатаНачала, ?(ДатаОкончания='0001-01-01', ДатаОкончания, КонецДня(ДатаОкончания)));
	Если НастройкаПериода.Редактировать() Тогда
		ДатаНачала = НастройкаПериода.ПолучитьДатуНачала();
		ДатаОкончания = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	ДопСписок = Новый СписокЗначений;
	ОбработкаРасшифровкиТиповогоОтчета(Расшифровка, СтандартнаяОбработка, ЭтаФорма, ДопСписок); 
КонецПроцедуры
